In [2]:
import pandas as pd
import numpy as np

In [ ]:
#EX1
names = pd.Series(['Alice Smith', 'Bob Jones', 'Charlie Brown ', 'David Wilson'])
names.str.lower()
names.str.upper()
names.str.len()

0    11
1     9
2    14
3    12
dtype: int64

In [15]:
#EX2
splitted_names = names.str.split()
splitted_names.str[0]
splitted_names.str[0].str[:3]

0    Ali
1    Bob
2    Cha
3    Dav
dtype: object

In [23]:
#EX3
names[names.apply(lambda x: x[0]== 'C')]

2    Charlie Brown
dtype: object

In [28]:
splitted_names[splitted_names.apply(lambda x: x[1] == 'Jones')]

1    [Bob, Jones]
dtype: object

In [30]:
from datetime import datetime 
dt = datetime(2023, 1, 1)
formatted_dt = dt.strftime('%d-%B-%Y') 
formatted_dt

'01-January-2023'

In [31]:
ts = pd.to_datetime('2023-05-15')
ts

Timestamp('2023-05-15 00:00:00')

In [34]:
#EX 5
ts = pd.to_datetime('2026-01-10')
ts_plus7 = ts + pd.Timedelta(days = 7)
ts_plus7

Timestamp('2026-01-17 00:00:00')

In [35]:
dates = pd.date_range(start = '2023-01-01', end = '2023-01-10')
dates

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08',
               '2023-01-09', '2023-01-10'],
              dtype='datetime64[ns]', freq='D')

In [36]:
monthly_periods = pd.period_range(start='2023-01', periods = 5, freq = 'M')
monthly_periods

PeriodIndex(['2023-01', '2023-02', '2023-03', '2023-04', '2023-05'], dtype='period[M]')

In [40]:
#EX6
dates=pd.date_range('2023-01-01', periods=6, freq='D')
data = pd.Series([10,12,15,14,18,20], index = dates)
data

2023-01-01    10
2023-01-02    12
2023-01-03    15
2023-01-04    14
2023-01-05    18
2023-01-06    20
Freq: D, dtype: int64

In [41]:
data['2023-01-03']

np.int64(15)

In [42]:
data['2023-01-02':'2023-01-05']

2023-01-02    12
2023-01-03    15
2023-01-04    14
2023-01-05    18
Freq: D, dtype: int64

In [44]:
#EX 7
dates = pd.date_range('2023-01-01', periods=100, freq='D')
df = pd.DataFrame({'Value': np.random.randn(100)}, index = dates)
df

               Value
2023-01-01  0.232257
2023-01-02 -0.646441
2023-01-03  0.455711
2023-01-04  1.027421
2023-01-05 -0.510590
...              ...
2023-04-06  1.159585
2023-04-07  0.735432
2023-04-08  0.381421
2023-04-09 -0.185937
2023-04-10 -0.540681

[100 rows x 1 columns]

In [46]:
monthly_mean = df.resample('M').mean()
monthly_mean

C:\Users\aynur\AppData\Local\Temp\ipykernel_7848\3652971464.py:1: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  monthly_mean = df.resample('M').mean()

               Value
2023-01-31  0.099665
2023-02-28  0.074132
2023-03-31 -0.147587
2023-04-30  0.036483

In [48]:
weekly_mean = df.resample('W').sum()
weekly_mean

               Value
2023-01-01  0.232257
2023-01-08  2.479483
2023-01-15  2.797263
2023-01-22 -4.966008
2023-01-29  2.728573
2023-02-05  1.593339
2023-02-12 -3.788821
2023-02-19  2.997212
2023-02-26 -0.453229
2023-03-05  0.027638
2023-03-12 -3.714721
2023-03-19  1.655889
2023-03-26  1.315148
2023-04-02 -2.430489
2023-04-09  1.022109
2023-04-16 -0.540681

In [50]:
#EX8
df["Shifted_Value"] = df["Value"].shift(1)
df

               Value  Shifted_Value
2023-01-01  0.232257            NaN
2023-01-02 -0.646441       0.232257
2023-01-03  0.455711      -0.646441
2023-01-04  1.027421       0.455711
2023-01-05 -0.510590       1.027421
...              ...            ...
2023-04-06  1.159585      -1.802160
2023-04-07  0.735432       1.159585
2023-04-08  0.381421       0.735432
2023-04-09 -0.185937       0.381421
2023-04-10 -0.540681      -0.185937

[100 rows x 2 columns]

In [53]:
df['Rolling_Mean']= df['Value'].rolling(window = 7).mean()
df

               Value  Shifted_Value  Rolling_Mean
2023-01-01  0.232257            NaN           NaN
2023-01-02 -0.646441       0.232257           NaN
2023-01-03  0.455711      -0.646441           NaN
2023-01-04  1.027421       0.455711           NaN
2023-01-05 -0.510590       1.027421           NaN
...              ...            ...           ...
2023-04-06  1.159585      -1.802160     -0.145060
2023-04-07  0.735432       1.159585      0.101433
2023-04-08  0.381421       0.735432      0.166582
2023-04-09 -0.185937       0.381421      0.146016
2023-04-10 -0.540681      -0.185937     -0.016455

[100 rows x 3 columns]

In [54]:
df.head(10)

               Value  Shifted_Value  Rolling_Mean
2023-01-01  0.232257            NaN           NaN
2023-01-02 -0.646441       0.232257           NaN
2023-01-03  0.455711      -0.646441           NaN
2023-01-04  1.027421       0.455711           NaN
2023-01-05 -0.510590       1.027421           NaN
2023-01-06  0.330774      -0.510590           NaN
2023-01-07 -0.727437       0.330774      0.023099
2023-01-08  2.550044      -0.727437      0.354212
2023-01-09  0.340541       2.550044      0.495209
2023-01-10  0.156198       0.340541      0.452422